---
kind: type
id: T:Autodesk.Revit.DB.LevelType
source: html/dea94d1d-f327-c5f3-3597-09774189cb9b.htm
---
# Autodesk.Revit.DB.LevelType

An object that represents a Level type.

## Syntax (C#)
```csharp
public class LevelType : LineAndTextAttrSymbol
```